# Робота світлофора для водіїв запрограмована таким чином: на початку кожної
# години протягом трьох хвилин горить зелений сигнал, потім протягом однієї хвилини -
# жовтий, протягом двох хвилин - червоний, протягом трьох хвилин - знову зелений і т. д.
# Розробити програму, яка вводить дійсне число t, що означає час в хвилинах, що
# минув з початку чергової години і визначає сигнал якого кольору горить для водіїв в цей
# момент.
# Мельничук Олена Костянтинівна 122В

while True:
    while True:
        try:
            t= int(input('Enter a time: '))
            break
        except ValueError:
            print('Please enter a time: ')
    q=t%6
    if 1<=q<=3:
        print('Green')
    elif q==4:
        print('Yellow')
    else:
        print('Red')
    result = input('Want to restart? If yes - 1, no - other: ')
    if result == '1':
        continue
    else:
        break



